import time
from datetime import datetime
from zoneinfo import ZoneInfo


def get_time_msk(t: float = None):
    """    Преобразует ts в дату и время по Москве    """
    moscow_tz = ZoneInfo("Europe/Moscow")
    if not t: t = time.time()
    try:
        dt = datetime.fromtimestamp(t, tz=moscow_tz)
        weekdays_ru = [
            "Воскресенье",
            "Понедельник",
            "Вторник",
            "Среда",
            "Четверг",
            "Пятница",
            "Суббота"
            ]
        # weekdays_ru = ["Вс.", "Пн.", "Вт.",
        #                "Ср.", "Чт.", "Пт.", "Сб."
        #                ]
        msk_time = dt.strftime("%Y-%m-%d %H:%M:%S,%f, ") + weekdays_ru[int(dt.strftime("%w"))]
        return msk_time
    except Exception as e:
        print(f"Произошла ошибка: {e}")
        return '1 апреля'


# now = time.time()
# print(now)
# print(timestamp_to_moscow())

"""
| Символ | Описание                          | Пример                     |
| ------ | --------------------------------- | -------------------------- |
| `%Y`   | Год с 4 цифрами                   | `2025`                     |
| `%y`   | Год с 2 цифрами                   | `25`                       |
| `%m`   | Месяц (01–12)                     | `09`                       |
| `%B`   | Полное название месяца            | `September`                |
| `%b`   | Сокращённое название месяца       | `Sep`                      |
| `%d`   | День месяца (01–31)               | `13`                       |
| `%H`   | Часы в 24-часовом формате (00–23) | `18`                       |
| `%I`   | Часы в 12-часовом формате (01–12) | `06`                       |
| `%p`   | AM / PM                           | `PM`                       |
| `%M`   | Минуты (00–59)                    | `30`                       |
| `%S`   | Секунды (00–59)                   | `44`                       |
| `%f`   | Микросекунды (000000–999999)      | `778002`                   |
| `%a`   | Сокращённое название дня недели   | `Sat`                      |
| `%A`   | Полное название дня недели        | `Saturday`                 |
| `%w`   | День недели (0–6, 0=Воскресенье)  | `6`                        |
| `%j`   | День года (001–366)               | `256`                      |
| `%c`   | Локальная дата и время            | `Sat Sep 13 18:30:44 2025` |
| `%x`   | Локальная дата                    | `09/13/25`                 |
| `%X`   | Локальное время                   | `18:30:44`                 |
| `%%`   | Символ `%`                        | `%`                        |

"""
